Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Note that when a message is received, the message type as a native long integer will be the first thing in VAR, followed by the actual message.
es_es: Note que en cuanto se recibe un mensaje, el tipo de mensaje, en formato de un entero largo en forma nativa, será la primera cosa almacenada en VAR, seguida por el mensaje real.

source: Here are three examples:
es_es: Aquí hay tres ejemplos:

source: /(\d\s){3}/ a three digits, each followed by a whitespace character (eg "3 4 5 ")
es_es: /(\d\s){3}/ tres dígitos, cada uno seguido de un carácter espacio (ej. "3 4 5 ")

source: See also L</oct> if all you have is a string.
es_es: Vea también L</oct> si todo lo que tiene es una cadena.

source: Beginning with v5.6.0, this operator is implemented using the standard C<File::Glob> extension.
es_es: Comenzando con v5.6.0, este operador está implementado usando la extensión estándar C<File::Glob>.

source: SCALAR will be grown or shrunk so that the last character actually read is the last character of the scalar after the read.
es_es: ESCALAR crecerá o se reducirá de manera que el último carácter leído es el último carácter del escalar después de la lectura.

source: sysopen(HANDLE, $path, O_RDWR|O_CREAT|O_EXCL)
es_es: sysopen(HANDLE, $ruta, O_RDWR|O_CREAT|O_EXCL)

source: perlgpl GNU General Public License
es_es: perlgpl Licencia GNU General Public License

# print "Executable " if -x _;
source: print "Executable\n" if -x _;
es_es: print "Ejecutable\n" if -x _;

source: Hint: you could say C<open(LOG,'logfile')> rather than C<open(log,'logfile')>.
es_es: Un consejo: es mejor escribir C<open(LOG,'archlog')> que C<open(log,'archlog')>.

source: to get all normal letters of the English alphabet, or
es_es: Para obtener todas las letras normales del alfabeto Inglés, o

source: One or more sections or subsections giving greater detail of available methods and routines and any other relevant information.
es_es: Una o más secciones o subsecciones dando mayor detalle de los métodos disponibles y las rutinas y cualquier otra información pertinente.

source: Put an asterisk C<*> before the C<v> to override the string to use to separate the numbers:
es_es: Pone un asterisco C<*> antes de C<v> para reemplazar la cadena a utilizar para separar los números:

source: The Perl source tree is big.
es_es: El árbol de código fuente de Perl es frondoso.

source: A precomputed hash value for the MRO's name, or 0.
es_es: Un valor de hash calculado previamente para el nombre del MRO, o 0.

source: Don't make your users specify parameters which will almost always be the same.
es_es: No haga que los usuarios especifiquen parámetros que casi siempre sean los mismos.

source: Tests for modules in F<ext/> and the dual-life modules are in F<t/> subdirectories for each module, like a standard CPAN distribution.
es_es: Las pruebas de los módulos de F<ext/> y los módulos de evolución dual están en los subdirectorios F<t/> de cada módulo, como en una distribución de CPAN estándar.

source: $str =~ /^\w/; # Match!
es_es: $str =~ /^\w/; # ¡Coincide!

source: Using single-quote as a delimiter protects the command from Perl's double-quote interpolation, passing it on to the shell instead:
es_es: Usando comillas simples como delimitadores impide la interpolación del doble entrecomillado de Perl, pasándolo, en su lugar, al shell:

source: Most of the power comes from implicit smart matching:
es_es: La mayor parte del poder viene de la coincidencia inteligente implícita:

source: Described in L<perlsub>.
es_es: Se describe en L<perlsub>

source: The faulty pointer arithmetic has been fixed.
es_es: La aritmética de punteros errónea ha sido corregida.

source: Also parsed as terms are the C<do {}> and C<eval {}> constructs, as well as subroutine and method calls, and the anonymous constructors C<[]> and C<{}>.
es_es: También son analizados como términos las construcciones C<do {}> y C<eval {}>, así como subrutina y llamadas a métodos, y los constructores anónimos C<[]> y C<{}>.

source: print {$fh} $binary;
es_es: print {$fh} $binario;

source: There is no need to have a C<main()> function or anything of that kind.
es_es: Es decir, no es necesario utilizar una función C<main()> ni nada similar.

source: The result may be used as a subpattern in a match:
es_es: El resultado puede ser utilizado como un sub-patrón en una coincidencia:

source: by Tim Bunce and Alligator Descartes
es_es: Tim Bunce y Alligator Descartes

source: A local modifies the listed variables to be local to the enclosing block, file, or eval.
es_es: Un local() modifica las variables listadas para que sean locales en el bloque que les rodea, un archivo o un eval().

source: C<%ENV = ()> and C<%ENV = @list> now work as expected (except on VMS where it generates a fatal error).
es_es: C<%ENV = ()> y C<%ENV = @list> ahora funcionan como se esperaba (excepto sobre VMS donde genera un error fatal).

source: ISBN 978-0-596-00476-7 [December 2003]
es_es: ISBN 978-0-596-00476-7 [Diciembre de 2003]

source: # be even if it did!!
es_es: # ¡Incluso si ya lo ha intentado!

source: die "No argument to customre::import allowed" if @_;
es_es: die "No se permiten argumentos para customre::import" if @_;

source: In completely unrelated news, you can now use safe signals with POSIX::SigAction.
es_es: En noticias aparte, ahora puede usar señales de forma segura con POSIX::sigaction.

# print "Hello, $name "; # works fine
source: print "Hello, $name\n"; # works fine
es_es: print "Hola, $nombre\n"; # funciona correctamente

source: Reentrant functions will (once more) work with C++.
es_es: Funciones reentrantes trabajarán (una vez más) con C++.

source: It was abandoned in 2006 ( http://www.nntp.perl.org/group/perl.ponie.dev/487 ).
es_es: Se abandonó en 2006 ( http://www.nntp.perl.org/group/perl.ponie.dev/487 ).

source: my $middle = substr $s, 4, -11; # black cat climbed the
es_es: my $middle = substr $s, 3, -12; # gato negro subió el

source: For reference on how regular expressions are used in matching operations, plus various examples of the same, see discussions of C<m//>, C<s///>, C<qr//> and C<??> in L<perlop/"Regexp Quote-Like Operators">.
es_es: Para tener una referencia sobre cómo las expresiones regulares se utilizan en operaciones de búsqueda, además de varios ejemplos de lo mismo, vea las discusiones sobre C<m//> C<s///>, C<qr//> y C<??> en L<perlop/"Operadores Regexp Entrecomillados">.

source: Most subroutines do not need to bother, though.
es_es: Sin embargo, la mayoría de las subrutinas no necesitan encargarse de esto.

source: =head1 NAME X<regular expression> X<regex> X<regexp>
es_es: =head1 NOMBRE X<expresión regular> X<regex> X<regexp>

source: perlhist Perl history records
es_es: perlhist Registros históricos de Perl

source: Namespaces with all lowercase names are considered reserved for Perl pragmata.
es_es: El espacio de nombres en minúsculas está considerado reservado para los pragmas de Perl.

source: (Perl scripts have always been able to be larger than that, it's just that the linenumber for reported errors and warnings have "wrapped around".) While scripts that large usually indicate a need to rethink your code a bit, such Perl scripts do exist, for example as results from generated code.
es_es: (Los programas Perl siempre han sido capaces de tener más que eso, es sólo que los números de línea de los informes de errores y advertencias son "reiniciados".) Mientras que scripts tan grandes como estos, por lo general, indican la necesidad de repensar un poco el código, scripts de Perl como estos existen, por ejemplo, de resultas de un código generado.

source: This problem has been corrected by adding directory syntax to relative path names, thus preventing logical name translation.
es_es: Este problema se ha corregido mediante la adición de la sintaxis de directorio de nombres de ruta de acceso relativo, evitando así la traducción de nombres lógicos.

source: Consider generalizing your code.
es_es: Considere generalizar su código.

source: =item C<(?<=pattern)> C<\K> X<(?<=)> X<look-behind, positive> X<lookbehind, positive> X<\K>
es_es: =item C<(?<=patrón)> C<\K> X<(?<=)> X<antecedente, positivo> X<antecedente, positivo> X<\K>

source: =head2 Memory optimisations
es_es: =head2 Optimizaciones de la memoria

source: # Add one to the value of any numbers in the string
es_es: # Suma uno al valor de todos los números en la cadena

source: You can use any combination of the methods from none to all four.
es_es: Puede usar cualquier combinación de estos métodos (desde ninguno hasta los cuatro).

source: COPYRIGHT and LICENSE
es_es: COPYRIGHT y LICENCIA

source: See L<perlsub>.
es_es: Ver L<perlsub>.

source: Written by Jarkko Hietaniemi <F<jhi@iki.fi>>, with many contributions from The Perl Porters and Perl Users submitting feedback and patches.
es_es: Escrito por Jarkko Hietaniemi <F<jhi@iki.fi>>, con muchas contribuciones de los I<Perl Porters> y usuarios Perl que suministraron comentarios y revisiones.

source: $oldfh = select(HANDLE); $| = 1; select($oldfh);
es_es: $anterior_fh = select(HANDLE); $| = 1; select($anterior_fh);

source: On the right side of a list operator, the comma has very low precedence, such that it controls all comma-separated expressions found there.
es_es: En el lado derecho de un operador de lista, la coma tiene una precedencia muy baja, de forma que controla todas las expresiones separadas por comas que se encuentren allí.

source: In particular, rounding is strongly biased to 0, though a number like C<"0.99999999999999999999"> has a chance of being rounded to 1.
es_es: En particular, hay un sesgo muy fuerte de redondeo a 0, aunque es posible que un número como C<"0.99999999999999999999"> se redondee a 1.

source: The main interface to Perl's documentation is C<perldoc>, although if you're reading this, it's more than likely that you've already found it.
es_es: Como ya sabe, la interfaz principal de la documentación de Perl es C<perldoc>.

source: =item C<(?PARNO)> C<(?-PARNO)> C<(?+PARNO)> C<(?R)> C<(?0)> X<(?PARNO)> X<(?1)> X<(?R)> X<(?0)> X<(?-1)> X<(?+1)> X<(?-PARNO)> X<(?+PARNO)> X<regex, recursive> X<regexp, recursive> X<regular expression, recursive> X<regex, relative recursion>
es_es: =item C<(?PARNO)> C<(?-PARNO)> C<(?+PARNO)> C<(?R)> C<(?0)> X<(?PARNO)> X<(?1)> X<(?R)> X<(?0)> X<(?-1)> X<(?+1)> X<(?-PARNO)> X<(?+PARNO)> X<regex, recursiva> X<regexp, recursiva> X<expresión regular, recursiva> X<regex, recursión relativa>

source: perlbeos Perl notes for BeOS
es_es: perlbeos Notas para BeOS

source: (Or technically speaking, a location capable of holding a hard reference, if it's an array or hash reference being used for assignment.) See L<perlreftut> and L<perlref>.
es_es: (O técnicamente hablando, un lugar capaz de contener una referencia dura, si se trata de una asignación de una referencia a un array o un hash). Vea L<perlreftut> y L<perlref>.

source: See L<perltie>, L<Tie::Hash>, L<Tie::Array>, L<Tie::Scalar>, and L<Tie::Handle>.
es_es: Ver L<perltie>, L<Tie::Hash>, L<Tie::Array>, L<Tie::Scalar>, y L<Tie::Handle>.

source: 7 size total size of file, in bytes
es_es: 7 size tamaño total del archivo, en bytes

source: die "Can't open $foo: $!" unless open(FOO,$foo);
es_es: die "No puedo abrir $foo: $!" unless open(FOO,$foo);

source: When C<$/> is set to C<undef> (sometimes known as file-slurp mode) and the file is empty, it returns C<''> the first time, followed by C<undef> subsequently.
es_es: Cuando C<$/> está configurado a C<undef> (a veces conocido como modo sorber-el-archivo) y el archivo está vacío, devuelve C<''> la primera vez, seguido por un C<undef>, posteriormente.

source: This operator quotes (and possibly compiles) its I<STRING> as a regular expression.
es_es: Este operador entrecomilla (y posiblemente compila) I<CADENA> como una expresión regular.

source: Enhanced documentation including MD5 weaknesses discovered lately
es_es: Documentación mejorada incluyendo las últimas debilidades descubiertas en MD5

source: if (/pattern/) {{
es_es: if (/patrón/) {{

source: Replace any occurrence of C<if BLOCK> by C<if (do BLOCK)>.
es_es: Reemplace cada ocurrencia de C<if BLOQUE> por C<if (do BLOQUE)>.

source: FIRSTKEY this
es_es: FIRSTKEY este

source: See also C<(?PARNO)> for a different, more efficient way to accomplish the same task.
es_es: Vea también C<(?PARNO)> para ver una manera diferente, más eficaz para realizar la misma tarea.

source: // now behaves like || in when clauses
es_es: // ahora se comporta como || en las cláusulas when

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
es_es: Este programa es distribuido con la esperanza de que será útil, pero SIN NINGUNA GARANTÍA; incluso sin la garantía implícita de COMERCIALIZACIÓN o IDONEIDAD PARA UN PROPÓSITO PARTICULAR.

source: The behavior that this switch enabled in 5.6.x releases may be supported in a transparent, data-dependent fashion in a future release.
es_es: El comportamiento que esta opción activaba en las versiones 5.6.x puede ser soportada de manera transparente, dependiendo de la moda, en una próxima versión.

source: 0 use zeros, not spaces, to right-justify
es_es: 0 usa ceros, no espacios, justificados a la derecha

source: If you build this from scratch, make sure you have a version of ld which supports it.
es_es: Si construye esto desde cero, asegúrese de que tiene una versión de ld que lo apoye.

source: Calls the System V IPC function msgrcv to receive a message from message queue ID into variable VAR with a maximum message size of SIZE.
es_es: Llama a la función System V IPC msgrcv para recibir un mensaje desde la cola de mensaje ID en la variable VAR con un tamaño máximo de mensaje.

source: This may change in a future version of Perl.
es_es: Esto puede cambiar en una futura versión de Perl.

source: When your manager forbids it--but do consider replacing them :-).
es_es: Cuando su jefe se lo prohíba; en ese caso, debe pensar en reemplazarlo (a su jefe) :-).

source: =head2 Magic goto and eval
es_es: =head2 goto y eval mágicos

source: A C<()> group is a sub-TEMPLATE enclosed in parentheses.
es_es: Un grupo C<()> es una sub-PLANTILLA encerrada entre paréntesis.

source: It is typically run by the makefiles created by L<ExtUtils::MakeMaker>.
es_es: Lo suelen ejecutar los archivos makefile generados por L<ExtUtils::MakeMaker>.

source: CGCC-2.7.2.x that comes with the DG/UX OS does NOT know the -pthread switch.
es_es: CGCC-2.7.2.x que viene con el sistema operativo DG/UX NO conoce la opción -pthread.

source: =item p X</p> X<regex, preserve> X<regexp, preserve>
es_es: =item p X</p> X<regex, preserve> X<regexp, preserve> X<regex, preservar>

source: Hence, if you have created a temporary value that you keep no pointer to, C<sv_2mortal()> to ensure that it is disposed of correctly.
es_es: Por lo tanto, si ha creado un valor temporal que se mantiene sin puntero a C<sv_2mortal()>, asegúrese de que se elimina de forma correcta.

source: C<Configure> will now detect C<clearenv> and C<unsetenv>, thanks to a patch from Alan Burlison.
es_es: C<Configure> ahora detectará C<clearenv> y C<unsetenv>, gracias a un parche de Alan Burlison.

source: In other words, if you try this:
es_es: En otras palabras, si intenta esto:

source: each file
es_es: por cada archivo

source: select STDOUT; $| = 1; # make unbuffered
es_es: select STDOUT; $| = 1; # hacerlo sin búfer

source: sub square {
es_es: sub cuadrado {

source: So C<:5.10> and C<:5.10.X> have identical effect.
es_es: Por tanto, C<:5,10> y C<:5.10.X> tienen un efecto idéntico.

source: Array Hash hash keys intersection grep { exists $b->{$_} } @$a
es_es: Array Hash claves hash intersección grep { exists $b->{$_} } @$a

source: F<cpan2dist> is a tool to create distributions (or packages) from CPAN modules, then suitable for your package manager of choice.
es_es: F<cpan2dist> es una herramienta que permite crear distribuciones (o paquetes) compatibles con distintos administradores de paquetes a partir de módulos de CPAN.

source: reset; # just reset ?one-time?
es_es: reset; # sólo reinicia las ?una-vez?

source: There may also be information at http://www.perl.org, the Perl Home Page.
es_es: También puede haber información en http://www.perl.org/, La página oficial de Perl.

source: %h = (first => 'A', second => 'B');
es_es: %h = (primero => 'A', segundo => 'B');

source: The yada-yada--or whatever--cannot stand in for an expression that is part of a larger statement since the C<...> is also the three-dot version of the binary range operator (see L<Range Operators>).
es_es: El blablablá -o lo-que-sea- no puede sustituir a una expresión que forma parte de una instrucción más grande debido a que C<...> es también la versión de tres puntos del operador rango (vea L<Operadores de rango>).

source: -g File has setgid bit set.
es_es: -g Archivo tiene puesto el bit setgid.

source: Configuration now tests for the presence of C<poll()>, and IO::Poll now uses the vendor-supplied function if detected.
es_es: Configuración ahora prueba por la presencia de C<poll()>, e IO::Poll ahora utiliza la función suministrada por el proveedor, si es detectada.

# print $count, " "; sleep(1);
source: print $count, "\n"; sleep(1);
es_es: print $cuenta, "\n"; sleep(1);

source: week_display();
es_es: semana_muestra();

source: In scalar context, concatenates the elements of LIST and returns a string value with all characters in the opposite order.
es_es: En contexto escalar, concatena los elementos LISTA y devuelve un valor de cadena con todos los caracteres en orden inverso.

source: say "Hurrah!";
es_es: say "¡Hurra!";

source: However, matches that would cross the Unicode rules/non-Unicode rules boundary (ords 255/256) will not succeed.
es_es: Sin embargo, las coincidencia que podrían cruzar los márgenes de las reglas Unicode/no-Unicode (ordinales 255/256) no tendrán éxito.

source: Here are some examples of how that works on an ASCII platform:
es_es: Aquí hay algunos ejemplos de cómo funciona esto en una plataforma ASCII:

source: =item ioctl FILEHANDLE,FUNCTION,SCALAR X<ioctl>
es_es: =item ioctl IDENTIFICADOR_ARCHIVO,FUNCIÓN,ESCALAR X<ioctl>

source: =item C<(*PRUNE)> C<(*PRUNE:NAME)> X<(*PRUNE)> X<(*PRUNE:NAME)>
es_es: =item C<(*PRUNE)> C<(*PRUNE:NOMBRE)> X<(*PRUNE)> X<(*PRUNE:NOMBRE)>

source: You can use the C<continue> keyword to fall through from one case to the next:
es_es: Puede usar la palabra clave C<continue> para pasar de un caso al siguiente:

source: There are probably very nice books published after this list was included in your Perl release, and you can check the latest released version at http://perldoc.perl.org/perlbook.html .
es_es: Es probable que se hayan publicado libros muy interesantes desde que se incluyó la lista en esta versión de Perl. Si lo desea, puede consultar la versión más reciente de la lista en http://perldoc.perl.org/perlbook.html .

source: Sets the umask for the process to EXPR and returns the previous value.
es_es: Establece la umask para el proceso a EXPR y devuelve el valor anterior.

source: In other words, Perl overloads certain operations based on whether the expected return value is singular or plural.
es_es: En otras palabras, Perl sobrecarga ciertas operaciones basándose en si el valor de retorno esperado es singular o plural.

source: printf "<%s>", "a"; # prints "<a>"
es_es: printf "<%s>", "a"; # imprime "<a>"

source: Inside an C<eval> the error message is stuffed into C<$@> and the C<eval> is terminated with the undefined value.
es_es: Dentro de un C<eval()>, el mensaje de error es colocado en C<$@> y el C<eval> termina con el valor I<undef> (indefinido).

source: s/%(.)/$percent{$1} || $&/ge; # expr now, so /e
es_es: s/%(.)/$porciento{$1} || $&/ge; # ahora es una expr., así que /e

source: =head2 Operator Precedence and Associativity X<operator, precedence> X<precedence> X<associativity>
es_es: =head2 Precedencia de operadores y asociatividad X<operator, precedence> X<precedence> X<associativity> X<operador, precedencia> X<precedencia> X<asociatividad>

source: which produces:
es_es: que produce:

source: At the risk of stating the obvious, modules are intended to be modular.
es_es: A riesgo de afirmar lo obvio, los módulos están destinados a ser modulares.

source: -R File is readable by real uid/gid.
es_es: -R Archivo es legible por el uid/gid real.

source: Think carefully about whether OO is appropriate for your module.
es_es: Piense con cuidado acerca de si la POO es apropiada para su módulo.

source: If you want to select on many filehandles, you may wish to write a subroutine like this:
es_es: Si desea seleccionar en muchos identificadores de archivo, puede desear escribir una subrutina de esta manera:

source: perlstyle - Perl style guide
es_es: perlstyle - Guía de estilo Perl

source: Check whether it's already been done in Perl, and avoid re-inventing the wheel unless you have a good reason.
es_es: Compruebe si ya se ha hecho en Perl, y evitará tener que volver a inventar la rueda, a menos que tenga una buena razón.

source: This effectively provides variable-length look-behind.
es_es: Esto, efectivamente, ofrece la posibilidad de búsquedas de antecedentes de longitud variable.

source: if ($line =~ s/\\$//) {
es_es: if ($linea =~ s/\\$//) {

source: Many good books have been written about Perl--see the section later in L<perlfaq2> for more details.
es_es: Se han escrito muchos libros buenos sobre Perl. Encontrará más información en una sección posterior de L<perlfaq2>.

source: =item Low-level socket functions X<socket> X<sock>
es_es: =item Funciones de bajo nivel de sockets X<socket> X<sock>

source: In other words, a pattern such as C<((?i)(&NAME))> does not change the case-sensitivity of the "NAME" pattern.
es_es: En otras palabras, un patrón como C<((?i)(&NOMBRE))> no cambia la sensibilidad al tamaño de caja del patrón "NOMBRE".

source: for $pat (@pats) {
es_es: for $patron (@patrones) {

source: This program provides an easy way to send a thank-you message back to the authors and maintainers of perl.
es_es: Este programa proporciona una manera sencilla de enviar un mensaje de agradecimiento a las personas que se encargan de desarrollar y mantener perl.

source: Always returns 1.
es_es: Siempre devuelve 1.

source: If you're using a relatively modern operating system and want to install this version of Perl locally, run the following commands:
es_es: Si está usando un sistema operativo relativamente moderno y desea instalar esta versión de Perl a nivel local, ejecute los siguientes comandos:

source: Raises an exception when used on a machine that doesn't implement POSIX setpgid(2) or BSD setpgrp(2).
es_es: Eleva una excepción si se usa en una máquina que no implemente POSIX setpgid(2) o BSD setpgrp(2).

source: In list context, the return values from the various get routines are as follows:
es_es: En contexto lista, los valores devueltos por varias de ellas son como sigue:

source: The compiler bug has been reported to SGI.
es_es: El error del compilador ha sido reportado a SGI.

source: The code above uses DB_File, but again it will work with any of the DBM modules.
es_es: El código anterior usa DB_File, pero funcionará con cualquiera de los módulos DBM.

source: \ references $$foo[1] aka $foo->[1]
es_es: \ crear referencia $$foo[1] equivale a $foo->[1]

source: $ref_to_AoA is a reference to an array, whereas @AoA is an array proper.
es_es: $ref_to_AoA es una referencia a un array, mientras que @AoA es un array.

source: system("program args 1>program.stdout 2>program.stderr");
es_es: system("programa argumentos 1>programa.stdout 2>programa.stderr");
